target/test-classes/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ws="http://koenighotze.org/docuservice">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:getDocumentRequest>
            <ws:name>Spain</ws:name>
        </ws:getDocumentRequest>
    </soapenv:Body>
</soapenv:Envelope>